---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.FittingAnnotationSize
source: html/fa274a1b-b910-16a0-f6a4-29a08c3c195e.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.FittingAnnotationSize Property

The value of fitting annotation size.

## Syntax (C#)
```csharp
public double FittingAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet.